init.org
#+DATE: [2015-03-27 vie 14:30]
#+TITLE: Configuración de emacs a través de org-mode
#+AUTHOR: Miguel Angel Piña Avelino
#+EMAIL: miguel_pinia@ciencias.unam.mx
#+STARTUP: indent
#+SETUPFILE: ~/proyectos/org-html-themes/setup/bigblow-pirilampo.setup
#+LANGUAGE: es
#+OPTIONS: author:miguelpinia email:miguel_pinia@ciencias.unam.mx creator:nil timestamp:nil
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LANGUAGE: es
#+TAGS: Configuración de Emacs

Esta es mi configuración de =emacs=, la cuál pongo a disposición para que todo
aquel que esté interesando pueda tomarla como referencia o usarla para su uso
propio. Esta configuración corresponde a lo que va en mi =~/.emacs.d/init.el=.
* Instrucciones de intalación

Para hacer uso de esta configuración, necesitas lo siguiente:

- Una copia de este documento.
- Emacs 24 (> 24.3)
- Org-mode (> 8.2)

Algo que no puedo asegurar, es el correcto funcionamiento de esta configuración
en otros sistemas operativos distintos de linux.

Una vez que tengas la copia de este documento, tu puedes copiarla en
=~/.emacs.d/init.org=. Entonces dentro de emacs teclea =M-x org-babel-load-file=.
=M-x= significa =Alt= y =x= presionados al mismo tiempo, seguido de la Instrucción
=org-babel-load-file= en el sub-buffer de emacs. Esto debería de evaluar todo el
código =emacs-lisp= que se encuentra en este documento.

Si eventualmente hay cambios sobre el código de este documento, basta con presionar
=C-c i=.


* Repositorios

Lo primero es definir las fuentes de donde obtendremos nuestros paquetes.
He definido 4 fuentes:
- [[http://marmalade-repo.org/packages/][Marmalade]]
- [[http://tromey.com/elpa/][Tromey]]
- [[http://elpa.gnu.org/packages/][Elpa]]
- [[http://melpa.milkbox.net/packages/][Melpa]]

#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives
	     '("marmalade" . "http://marmalade-repo.org/packages/") t)
(add-to-list 'package-archives
             '("tromey" . "http://tromey.com/elpa/") t)
(add-to-list 'package-archives
	     '("elpa" . "http://elpa.gnu.org/packages/") t)
(add-to-list 'package-archives
            '("melpa" . "http://melpa.milkbox.net/packages/") t)

#+end_src
Una vez añadidos los repositorios de nuestros paquetes, hay que definir
cuales van a ser los paquetes que vamos a utilizar y como los vamos a cargar
de manera *automática*.
#+begin_src emacs-lisp
(package-initialize)
(when (not package-archive-contents)
  (package-refresh-contents))
(defvar my-packages
  '(auto-package-update
    nyan-mode
    nyan-prompt
    rainbow-delimiters
    flymake
    column-enforce-mode
    diminish
    saveplace
    highlight-chars
    neotree
    auto-complete
    apropos-fn+var
    autopair
    yasnippet
    flycheck
    paredit
    magit
    helm
    smex
    find-file-in-repository
    projectile
    auctex
    ac-math
    auto-complete-auctex
    xml-rpc
    metaweblog
    org2blog
    htmlize
    netrc
    tagedit
    deferred
    python-mode
    ipython
    jedi
    ein
    ein-mumamo
    clojure-mode
    clojure-mode-extra-font-locking
    cider
    web-mode
    php-mode
    coffee-mode
    markdown-mode
    markdown-mode+
    ack
    cdlatex
    ob-sml
    jabber
    alert
    interleave
))
(dolist (p my-packages)
  (when (not (package-installed-p p))
    (package-install p)))
#+end_src

