init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<title>Configuración de emacs a través de org-mode</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Miguel Angel Piña Avelino" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Configuración de emacs a través de org-mode</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Instrucciones de intalación</a></li>
<li><a href="#sec-2">2. Repositorios</a></li>
<li><a href="#sec-3">3. Interfaz gráfica</a></li>
<li><a href="#sec-4">4. Edición</a></li>
</ul>
</div>
</div>
<p>
Esta es mi configuración de <code>emacs</code>, la cuál pongo a disposición para que todo
aquel que esté interesando pueda tomarla como referencia o usarla para su uso
propio. Esta configuración corresponde a lo que va en mi <code>~/.emacs.d/init.el</code>.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Instrucciones de intalación</h2>
<div class="outline-text-2" id="text-1">
<p>
Para hacer uso de esta configuración, necesitas lo siguiente:
</p>

<ul class="org-ul">
<li>Una copia de este documento.
</li>
<li>Emacs 24 (&gt; 24.3)
</li>
<li>Org-mode (&gt; 8.2)
</li>
</ul>

<p>
Algo que no puedo asegurar, es el correcto funcionamiento de esta configuración
en otros sistemas operativos distintos de linux.
</p>

<p>
Una vez que tengas la copia de este documento, tu puedes copiarla en
<code>~/.emacs.d/init.org</code>. Entonces dentro de emacs teclea <code>M-x org-babel-load-file</code>.
<code>M-x</code> significa <code>Alt</code> y <code>x</code> presionados al mismo tiempo, seguido de la Instrucción
<code>org-babel-load-file</code> en el sub-buffer de emacs. Esto debería de evaluar todo el
código <code>emacs-lisp</code> que se encuentra en este documento.
</p>

<p>
Si eventualmente hay cambios sobre el código de este documento, basta con presionar
<code>C-c i</code>.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Repositorios</h2>
<div class="outline-text-2" id="text-2">
<p>
Lo primero es definir las fuentes de donde obtendremos nuestros paquetes.
He definido 4 fuentes:
</p>
<ul class="org-ul">
<li><a href="http://marmalade-repo.org/packages/">Marmalade</a>
</li>
<li><a href="http://tromey.com/elpa/">Tromey</a>
</li>
<li><a href="http://elpa.gnu.org/packages/">Elpa</a>
</li>
<li><a href="http://melpa.milkbox.net/packages/">Melpa</a>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span><span style="color: #c397d8;">require</span> '<span style="color: #70c0b1;">package</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-to-list 'package-archives
             '<span style="color: #7aa6da;">(</span><span style="color: #b9ca4a;">"marmalade"</span> . <span style="color: #b9ca4a;">"http://marmalade-repo.org/packages/"</span><span style="color: #7aa6da;">)</span> t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-to-list 'package-archives
             '<span style="color: #7aa6da;">(</span><span style="color: #b9ca4a;">"tromey"</span> . <span style="color: #b9ca4a;">"http://tromey.com/elpa/"</span><span style="color: #7aa6da;">)</span> t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-to-list 'package-archives
             '<span style="color: #7aa6da;">(</span><span style="color: #b9ca4a;">"elpa"</span> . <span style="color: #b9ca4a;">"http://elpa.gnu.org/packages/"</span><span style="color: #7aa6da;">)</span> t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-to-list 'package-archives
            '<span style="color: #7aa6da;">(</span><span style="color: #b9ca4a;">"melpa"</span> . <span style="color: #b9ca4a;">"http://melpa.milkbox.net/packages/"</span><span style="color: #7aa6da;">)</span> t<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Una vez añadidos los repositorios de nuestros paquetes, hay que definir
cuales van a ser los paquetes que vamos a utilizar y como los vamos a cargar
de manera <b>automática</b>.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>package-initialize<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">when</span> <span style="color: #7aa6da;">(</span>not package-archive-contents<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>package-refresh-contents<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defvar</span> <span style="color: #e78c45;">my-packages</span>
  '<span style="color: #7aa6da;">(</span>auto-package-update
    nyan-mode
    nyan-prompt
    rainbow-delimiters
    flymake
    column-enforce-mode
    diminish
    saveplace
    highlight-chars
    neotree
    auto-complete
    apropos-fn+var
    autopair
    yasnippet
    flycheck
    paredit
    magit
    ido-ubiquitous
    smex
    find-file-in-repository
    projectile
    auctex
    ac-math
    auto-complete-auctex
    xml-rpc
    metaweblog
    org2blog
    htmlize
    netrc
    tagedit
    deferred
    python-mode
    ipython
    jedi
    ein
    ein-mumamo
    clojure-mode
    clojure-mode-extra-font-locking
    cider
    web-mode
    php-mode
    coffee-mode
    markdown-mode
    markdown-mode+
    ack
    cdlatex
    ob-sml
    jabber
    alert
    interleave
<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">dolist</span> <span style="color: #7aa6da;">(</span>p my-packages<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span><span style="color: #c397d8;">when</span> <span style="color: #70c0b1;">(</span>not <span style="color: #b9ca4a;">(</span>package-installed-p p<span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>package-install p<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>
</div>
</div>
