init.org
* Interfaz gráfica

Algo que siempre me recriminan es la cuestión de que emacs se ve muy viejo. ¡El
problema es qué ellos no saben que altamente configurable y personalizable!

Entonces, después de configurar hay que añadir los siguientes paquetes para
comenzar a jugar con la interfaz de emacs.

#+begin_src emacs-lisp
(require 'flymake)
(require 'nyan-mode)
(require 'nyan-prompt)
(require 'rainbow-delimiters)
(require 'column-enforce-mode)
#+end_src

Establecemos el tamaño que tendrá al iniciar emacs.

#+begin_src emacs-lisp
(when window-system (set-frame-size (selected-frame) 80 36))
#+end_src
Establecemos una fuente agradable
#+begin_src emacs-lisp
(set-frame-font "Monofur 14")
#+end_src
Indicamos que queremos ver el número de lineas.
#+begin_src emacs-lisp
(global-linum-mode)
#+end_src
Indicamos que durante la edición podamos el número de linea y el número de
columna en el que estamos trabajando
#+begin_src emacs-lisp
(setq column-number-mode t)
#+end_src
Cargamos los temas que vamos a aplicarle a emacs.
#+begin_src emacs-lisp
(add-to-list 'custom-theme-load-path "~/.emacs.d/temas")
(add-to-list 'load-path "~/.emacs.d/temas")
(load-theme 'tomorrow-night-bright t)
#+end_src
Indicamos que el título de la ventana va a ser el path del archivo que estamos
editando en el buffer actual.
#+begin_src emacs-lisp
(setq-default frame-title-format "%b (%f)")
#+end_src
Una de las características que menos me gusta, es que el cursor se encuentre
parpadeando, por lo que lo vamos a quitar. Así como que cada vez que hace una
evaluación campaneé.
#+begin_src emacs-lisp
(blink-cursor-mode 0)
(setq ring-bell-function 'ignore)
#+end_src
Indicamos que resalte la linea actual
#+begin_src emacs-lisp
(global-hl-line-mode 1)
#+end_src
Quéremos que resalte los paréntesis y sus matchs.
#+begin_src emacs-lisp
(show-paren-mode 1)
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
#+end_src
Inhabilitamos la barra de menús y de herramientas
#+begin_src emacs-lisp
(menu-bar-mode -1)
(when (fboundp 'scroll-bar-mode)
  (scroll-bar-mode -1)
  (tool-bar-mode -1))
#+end_src
Definimos una función para ingresar a pantalla completa.
#+begin_src emacs-lisp
(defun fullscreen ()
  "TO-DO."
  (interactive)
  (set-frame-parameter nil 'fullscreen
                       (if (frame-parameter nil 'fullscreen) nil 'fullboth)))
(global-set-key [f11] 'fullscreen)
#+end_src
Quiero que me enseñe el estado de la batería de la laptop, así como la hora
actual.
#+begin_src emacs-lisp
(display-battery-mode t)
(display-time-mode)
#+end_src

Utilizamos a Nyan-Cat como indicador de la posición en el buffer.
#+begin_src emacs-lisp
(nyan-mode t)
(nyan-start-animation)
(setq nyan-wavy-trail t)
#+end_src

Limpiamos el mode-line
#+begin_src emacs-lisp
(defvar mode-line-cleaner-alist
  `((auto-complete-mode . " α")
    (yas/minor-mode . " υ")
    (paredit-mode . " π")
    (eldoc-mode . "")
    (column-enforce-mode . " 80")
    (abbrev-mode . "")
    (lisp-interaction-mode . " λ")
    (hi-lock-mode . "")
    (python-mode . " Π")
    (emacs-lisp-mode . " ε")
    (nxhtml-mode . " nx")
    (fundamental-mode . " F")
    (latex-mode . " Φ")
    (flycheck-mode . " Γ")
    (magit-auto-revert-mode . " gR")
    (yas-global-mode . " ψ")
    (yas-minor-mode . " ψ")
    (projectile-mode . " ρ"))
  "Una lista para 'clean-mode-line'.")

(defun clean-mode-line ()
  "TO-DO."
  (interactive)
  (loop for cleaner in mode-line-cleaner-alist
        do (let* ((mode (car cleaner))
                 (mode-str (cdr cleaner))
                 (old-mode-str (cdr (assq mode minor-mode-alist))))
             (when old-mode-str
                 (setcar old-mode-str mode-str))
             (when (eq mode major-mode)
               (setq mode-name mode-str)))))
(add-hook 'after-change-major-mode-hook 'clean-mode-line)

(defalias 'flymake-report-status 'flymake-report-status-slim)
(defun flymake-report-status-slim (e-w &optional status)
  "Show \"slim\" flymake status in mode line. E-W as. STATUS as."
  (when e-w
    (setq flymake-mode-line-e-w e-w))
  (when status
    (setq flymake-mode-line-status status))
  (let* ((mode-line " Φ"))
    (when (> (length flymake-mode-line-e-w) 0)
      (setq mode-line (concat mode-line ":" flymake-mode-line-e-w)))
    (setq mode-line (concat mode-line flymake-mode-line-status))
    (setq flymake-mode-line mode-line)
    (force-mode-line-update)))
#+end_src

