init.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Interfaz gráfica</h2>
<div class="outline-text-2" id="text-3">
<p>
Algo que siempre me recriminan es la cuestión de que emacs se ve muy viejo. ¡El
problema es qué ellos no saben que altamente configurable y personalizable!
</p>

<p>
Entonces, después de configurar hay que añadir los siguientes paquetes para
comenzar a jugar con la interfaz de emacs.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span><span style="color: #c397d8;">require</span> '<span style="color: #70c0b1;">flymake</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">require</span> '<span style="color: #70c0b1;">nyan-mode</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">require</span> '<span style="color: #70c0b1;">nyan-prompt</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">require</span> '<span style="color: #70c0b1;">rainbow-delimiters</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">require</span> '<span style="color: #70c0b1;">column-enforce-mode</span><span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
Establecemos el tamaño que tendrá al iniciar emacs.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span><span style="color: #c397d8;">when</span> window-system <span style="color: #7aa6da;">(</span>set-frame-size <span style="color: #70c0b1;">(</span>selected-frame<span style="color: #70c0b1;">)</span> 80 36<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Establecemos una fuente agradable
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>set-frame-font <span style="color: #b9ca4a;">"Monofur 14"</span><span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Indicamos que queremos ver el número de lineas.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>global-linum-mode<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Indicamos que durante la edición podamos el número de linea y el número de
columna en el que estamos trabajando
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>setq column-number-mode t<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Cargamos los temas que vamos a aplicarle a emacs.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>add-to-list 'custom-theme-load-path <span style="color: #b9ca4a;">"~/.emacs.d/temas"</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-to-list 'load-path <span style="color: #b9ca4a;">"~/.emacs.d/temas"</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>load-theme 'tomorrow-night-bright t<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Indicamos que el título de la ventana va a ser el path del archivo que estamos
editando en el buffer actual.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>setq-default frame-title-format <span style="color: #b9ca4a;">"%b (%f)"</span><span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Una de las características que menos me gusta, es que el cursor se encuentre
parpadeando, por lo que lo vamos a quitar. Así como que cada vez que hace una
evaluación campaneé.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>blink-cursor-mode 0<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq ring-bell-function 'ignore<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Indicamos que resalte la linea actual
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>global-hl-line-mode 1<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Quéremos que resalte los paréntesis y sus matchs.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>show-paren-mode 1<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'prog-mode-hook 'rainbow-delimiters-mode<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Inhabilitamos la barra de menús y de herramientas
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>menu-bar-mode -1<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">when</span> <span style="color: #7aa6da;">(</span>fboundp 'scroll-bar-mode<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>scroll-bar-mode -1<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>tool-bar-mode -1<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Definimos una función para ingresar a pantalla completa.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">fullscreen</span> <span style="color: #7aa6da;">()</span>
  <span style="color: #969896;">"TO-DO."</span>
  <span style="color: #7aa6da;">(</span>interactive<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>set-frame-parameter nil 'fullscreen
                       <span style="color: #70c0b1;">(</span><span style="color: #c397d8;">if</span> <span style="color: #b9ca4a;">(</span>frame-parameter nil 'fullscreen<span style="color: #b9ca4a;">)</span> nil 'fullboth<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">[</span>f11<span style="color: #7aa6da;">]</span> 'fullscreen<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Quiero que me enseñe el estado de la batería de la laptop, así como la hora
actual.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>display-battery-mode t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>display-time-mode<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
Utilizamos a Nyan-Cat como indicador de la posición en el buffer.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span>nyan-mode t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>nyan-start-animation<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq nyan-wavy-trail t<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
Limpiamos el mode-line
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #c397d8;">(</span><span style="color: #c397d8;">defvar</span> <span style="color: #e78c45;">mode-line-cleaner-alist</span>
  `<span style="color: #7aa6da;">(</span><span style="color: #70c0b1;">(</span>auto-complete-mode . <span style="color: #b9ca4a;">" &#945;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>yas/minor-mode . <span style="color: #b9ca4a;">" &#965;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>paredit-mode . <span style="color: #b9ca4a;">" &#960;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>eldoc-mode . <span style="color: #b9ca4a;">""</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>column-enforce-mode . <span style="color: #b9ca4a;">" 80"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>abbrev-mode . <span style="color: #b9ca4a;">""</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>lisp-interaction-mode . <span style="color: #b9ca4a;">" &#955;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>hi-lock-mode . <span style="color: #b9ca4a;">""</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>python-mode . <span style="color: #b9ca4a;">" &#928;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>emacs-lisp-mode . <span style="color: #b9ca4a;">" &#949;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>nxhtml-mode . <span style="color: #b9ca4a;">" nx"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>fundamental-mode . <span style="color: #b9ca4a;">" F"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>latex-mode . <span style="color: #b9ca4a;">" &#934;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>flycheck-mode . <span style="color: #b9ca4a;">" &#915;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>magit-auto-revert-mode . <span style="color: #b9ca4a;">" gR"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>yas-global-mode . <span style="color: #b9ca4a;">" &#968;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>yas-minor-mode . <span style="color: #b9ca4a;">" &#968;"</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>projectile-mode . <span style="color: #b9ca4a;">" &#961;"</span><span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span>
  <span style="color: #969896;">"Una lista para 'clean-mode-line'."</span><span style="color: #c397d8;">)</span>

<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">clean-mode-line</span> <span style="color: #7aa6da;">()</span>
  <span style="color: #969896;">"TO-DO."</span>
  <span style="color: #7aa6da;">(</span>interactive<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>loop for cleaner in mode-line-cleaner-alist
        do <span style="color: #70c0b1;">(</span><span style="color: #c397d8;">let*</span> <span style="color: #b9ca4a;">(</span><span style="color: #e7c547;">(</span>mode <span style="color: #e78c45;">(</span>car cleaner<span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span>
                 <span style="color: #e7c547;">(</span>mode-str <span style="color: #e78c45;">(</span>cdr cleaner<span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span>
                 <span style="color: #e7c547;">(</span>old-mode-str <span style="color: #e78c45;">(</span>cdr <span style="color: #d54e53;">(</span>assq mode minor-mode-alist<span style="color: #d54e53;">)</span><span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span>
             <span style="color: #b9ca4a;">(</span><span style="color: #c397d8;">when</span> old-mode-str
                 <span style="color: #e7c547;">(</span>setcar old-mode-str mode-str<span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span>
             <span style="color: #b9ca4a;">(</span><span style="color: #c397d8;">when</span> <span style="color: #e7c547;">(</span>eq mode major-mode<span style="color: #e7c547;">)</span>
               <span style="color: #e7c547;">(</span>setq mode-name mode-str<span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'after-change-major-mode-hook 'clean-mode-line<span style="color: #c397d8;">)</span>

<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defalias</span> '<span style="color: #7aa6da;">flymake-report-status</span> 'flymake-report-status-slim<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">flymake-report-status-slim</span> <span style="color: #7aa6da;">(</span>e-w <span style="color: #e7c547;">&amp;optional</span> status<span style="color: #7aa6da;">)</span>
  <span style="color: #969896;">"Show \"slim\" flymake status in mode line. E-W as. STATUS as."</span>
  <span style="color: #7aa6da;">(</span><span style="color: #c397d8;">when</span> e-w
    <span style="color: #70c0b1;">(</span>setq flymake-mode-line-e-w e-w<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span><span style="color: #c397d8;">when</span> status
    <span style="color: #70c0b1;">(</span>setq flymake-mode-line-status status<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span><span style="color: #c397d8;">let*</span> <span style="color: #70c0b1;">(</span><span style="color: #b9ca4a;">(</span>mode-line <span style="color: #b9ca4a;">" &#934;"</span><span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span><span style="color: #c397d8;">when</span> <span style="color: #b9ca4a;">(</span>&gt; <span style="color: #e7c547;">(</span>length flymake-mode-line-e-w<span style="color: #e7c547;">)</span> 0<span style="color: #b9ca4a;">)</span>
      <span style="color: #b9ca4a;">(</span>setq mode-line <span style="color: #e7c547;">(</span>concat mode-line <span style="color: #b9ca4a;">":"</span> flymake-mode-line-e-w<span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>setq mode-line <span style="color: #b9ca4a;">(</span>concat mode-line flymake-mode-line-status<span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>setq flymake-mode-line mode-line<span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span>force-mode-line-update<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>
</div>
</div>
