init.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Edición</h2>
<div class="outline-text-2" id="text-4">
<p>
Agregamos todos los paquetes que vayamos a necesitar
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'saveplace<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'highlight-chars<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'neotree<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'auto-complete<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'autopair<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'yasnippet<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'flycheck<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'apropos<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'auto-complete-config<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'iso-transl<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'undo-tree<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
Verificamos la sintaxis de código al <i>vuelo</i>.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>global-flycheck-mode t<span style="color: #c397d8;">)</span>
</pre>
</div>

<p>
No usamos tabs duros.
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>setq-default indent-tabs-mode <span style="color: #70c0b1;">nil</span><span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Configuramos a emacs de tal forma que pueda compartir el clipboard con
el sistema operativo.
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>setq
 x-select-enable-clipboard t
 x-select-enable-primary t
 save-interprogram-paste-before-kill t
 apropos-do-all t
 mouse-yank-at-point t<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Configuramos la búsqueda en el buffer.
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">(</span>kbd <span style="color: #b9ca4a;">"C-s"</span><span style="color: #7aa6da;">)</span> 'isearch-forward-regexp<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">(</span>kbd <span style="color: #b9ca4a;">"C-r"</span><span style="color: #7aa6da;">)</span> 'isearch-backward-regexp<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">(</span>kbd <span style="color: #b9ca4a;">"C-M-s"</span><span style="color: #7aa6da;">)</span> 'isearch-forward<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">(</span>kbd <span style="color: #b9ca4a;">"C-M-r"</span><span style="color: #7aa6da;">)</span> 'isearch-backward<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Una característica que me gustaba de mis anteriores editores es el duplicar
una linea  de código.
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>global-set-key <span style="color: #b9ca4a;">"\C-c\C-d"</span> <span style="color: #b9ca4a;">"\C-a\C- \C-n\M-w\C-y"</span><span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Creamos respaldos automáticos y la posición donde te quedaste en cada uno de
los archivos.
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>setq backup-directory-alist
      `<span style="color: #7aa6da;">(</span><span style="color: #70c0b1;">(</span><span style="color: #b9ca4a;">"."</span> . ,<span style="color: #b9ca4a;">(</span><span style="color: #70c0b1;">concat</span> user-emacs-directory <span style="color: #b9ca4a;">"backups"</span><span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq auto-save-default <span style="color: #70c0b1;">nil</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq-default save-place t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq save-place-file <span style="color: #7aa6da;">(</span><span style="color: #70c0b1;">concat</span> user-emacs-directory <span style="color: #b9ca4a;">"places"</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Una buena práctica es evitar dejar espacios en blanco innecesarios.
A continuación la configuración para quitar esos espacios al guardar.
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>add-hook 'font-lock-mode-hook 'hc-highlight-trailing-whitespace<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'LaTeX-mode-hook 'hc-highlight-trailing-whitespace<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'latex-mode-hook 'hc-highlight-trailing-whitespace<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'python-mode-hook 'hc-highlight-trailing-whitespace<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'prog-mode-hook 'hc-highlight-trailing-whitespace<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'prog-mode-hook
           <span style="color: #7aa6da;">(</span>lambda <span style="color: #70c0b1;">()</span>
             <span style="color: #70c0b1;">(</span>add-to-list 'write-file-functions 'delete-trailing-whitespace<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'LaTeX-mode-hook
           <span style="color: #7aa6da;">(</span>lambda <span style="color: #70c0b1;">()</span>
             <span style="color: #70c0b1;">(</span>add-to-list 'write-file-functions 'delete-trailing-whitespace<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'LaTeX-mode-hook
          <span style="color: #7aa6da;">(</span>lambda <span style="color: #70c0b1;">()</span>
            <span style="color: #70c0b1;">(</span>add-to-list 'write-file-functions 'delete-blank-lines<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'prog-mode-hook
          <span style="color: #7aa6da;">(</span>lambda <span style="color: #70c0b1;">()</span>
            <span style="color: #70c0b1;">(</span>add-to-list 'write-file-functions 'delete-blank-lines<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Resaltado de caracteres a partir de la columna 80.
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>add-hook 'LaTeX-mode-hook 'column-enforce-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'python-mode-hook 'column-enforce-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'prog-mode-hook 'column-enforce-mode<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Comentarios
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">Comentarios</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">toggle-comment-on-line</span> <span style="color: #7aa6da;">()</span>
  <span style="color: #b9ca4a;">"Comenta o descomenta la l&#237;nea actual."</span>
  <span style="color: #7aa6da;">(</span>interactive<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>comment-or-uncomment-region <span style="color: #70c0b1;">(</span>line-beginning-position<span style="color: #70c0b1;">)</span> <span style="color: #70c0b1;">(</span>line-end-position<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">(</span>kbd <span style="color: #b9ca4a;">"C-;"</span><span style="color: #7aa6da;">)</span> 'toggle-comment-on-line<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Otros
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">die-tabs</span> <span style="color: #7aa6da;">()</span>
  <span style="color: #b9ca4a;">"Usa s&#243;lo 2 espacios para los tabs."</span>
  <span style="color: #7aa6da;">(</span>interactive<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>set-variable 'tab-width 2<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>mark-whole-buffer<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>untabify <span style="color: #70c0b1;">(</span>region-beginning<span style="color: #70c0b1;">)</span> <span style="color: #70c0b1;">(</span>region-end<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>keyboard-quit<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">[</span>f8<span style="color: #7aa6da;">]</span> 'neotree-toggle<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>put 'downcase-region 'disabled <span style="color: #70c0b1;">nil</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq create-lockfiles <span style="color: #70c0b1;">nil</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq inhibit-startup-message t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defvar</span> <span style="color: #7aa6da;">ack-history</span> <span style="color: #70c0b1;">nil</span>
  <span style="color: #b9ca4a;">"History for the `ack' command."</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">revert-buffer-no-confirm</span> <span style="color: #7aa6da;">()</span>
    <span style="color: #b9ca4a;">"Revert buffer without confirmation."</span>
    <span style="color: #7aa6da;">(</span>interactive<span style="color: #7aa6da;">)</span>
    <span style="color: #7aa6da;">(</span>revert-buffer t t<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">(</span>kbd <span style="color: #b9ca4a;">"C-c r"</span><span style="color: #7aa6da;">)</span> 'revert-buffer-no-confirm<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-undo-tree-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>global-set-key <span style="color: #7aa6da;">(</span>kbd <span style="color: #b9ca4a;">"C-c _"</span><span style="color: #7aa6da;">)</span> 'undo-tree-visualize<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Autocompletado
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>add-to-list 'ac-dictionary-directories <span style="color: #b9ca4a;">"~/.emacs.d/custom/dict"</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>set-default 'ac-sources
             '<span style="color: #7aa6da;">(</span>ac-source-abbrev
               ac-source-dictionary
               ac-source-yasnippet
               ac-source-words-in-buffer
               ac-source-words-in-same-mode-buffers
               ac-source-semantic<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>

<span style="color: #c397d8;">(</span>ac-config-default<span style="color: #c397d8;">)</span>

<span style="color: #c397d8;">(</span>dolist <span style="color: #7aa6da;">(</span>m '<span style="color: #70c0b1;">(</span>c-mode c++-mode java-mode org-mode<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>add-to-list 'ac-modes m<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>

<span style="color: #c397d8;">(</span>global-auto-complete-mode t<span style="color: #c397d8;">)</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">auto-complete mode extra settings</span>
<span style="color: #c397d8;">(</span>setq ac-auto-start 2<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq ac-use-overriding-local-map <span style="color: #70c0b1;">nil</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq ac-use-menu-map t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq ac-candidate-limit 20<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Paredit
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span>autoload 'enable-paredit-mode <span style="color: #b9ca4a;">"paredit"</span>
  <span style="color: #b9ca4a;">"Turn on pseudo-structural editing of Lisp code."</span> t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'ielm-mode-hook             #'enable-paredit-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'lisp-mode-hook             #'enable-paredit-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'scheme-mode-hook           #'enable-paredit-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>add-hook 'ielm-mode-hook 'turn-on-eldoc-mode<span style="color: #c397d8;">)</span>
</pre>
</div>
<p>
Soporte para org-mode
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #c397d8;">(</span><span style="color: #70c0b1;">require</span> 'org<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">define-key</span> <span style="color: #7aa6da;">global-map</span> <span style="color: #b9ca4a;">"\C-cl"</span> 'org-store-link<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">define-key</span> <span style="color: #7aa6da;">global-map</span> <span style="color: #b9ca4a;">"\C-ca"</span> 'org-agenda<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq org-log-done t<span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>setq org-agenda-files <span style="color: #7aa6da;">(</span><span style="color: #70c0b1;">list</span> <span style="color: #b9ca4a;">"~/org/alimentarias.org"</span>
                             <span style="color: #b9ca4a;">"~/org/estacionamiento.org"</span>
                             <span style="color: #b9ca4a;">"~/org/casa.org"</span>
                             <span style="color: #b9ca4a;">"~/org/Ingenier&#237;aSoftware.org"</span>
                             <span style="color: #b9ca4a;">"~/org/labsom.org"</span>
                             <span style="color: #b9ca4a;">"~/org/todo.org"</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defvar</span> <span style="color: #7aa6da;">count-words-buffer</span>
  <span style="color: #70c0b1;">nil</span>
  <span style="color: #b9ca4a;">"*Number of words in the buffer."</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">wicked/update-wc</span> <span style="color: #7aa6da;">()</span>
  <span style="color: #b9ca4a;">"Whatever."</span>
  <span style="color: #7aa6da;">(</span>interactive<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>setq count-words-buffer <span style="color: #70c0b1;">(</span>number-to-string <span style="color: #b9ca4a;">(</span>count-words-buffer<span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>force-mode-line-update<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>unless count-words-buffer
<span style="color: #7aa6da;">(</span>run-with-idle-timer 1 t '<span style="color: #e7c547;">wicked</span>/update-wc<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span>unless <span style="color: #7aa6da;">(</span>memq 'count-words-buffer global-mode-string<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>add-to-list 'global-mode-string <span style="color: #b9ca4a;">"words: "</span> t<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>add-to-list 'global-mode-string 'count-words-buffer t<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">count-words-buffer</span> <span style="color: #7aa6da;">()</span>
  <span style="color: #b9ca4a;">"Count the number of words in the current paragraph."</span>
  <span style="color: #7aa6da;">(</span>interactive<span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>save-excursion
    <span style="color: #70c0b1;">(</span>goto-char <span style="color: #b9ca4a;">(</span>point-min<span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span>
    <span style="color: #70c0b1;">(</span><span style="color: #c397d8;">let</span> <span style="color: #b9ca4a;">(</span><span style="color: #e7c547;">(</span><span style="color: #70c0b1;">count</span> 0<span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span>
      <span style="color: #b9ca4a;">(</span><span style="color: #70c0b1;">while</span> <span style="color: #e7c547;">(</span><span style="color: #70c0b1;">not</span> <span style="color: #e78c45;">(</span>eobp<span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span>
        <span style="color: #e7c547;">(</span>forward-word 1<span style="color: #e7c547;">)</span>
        <span style="color: #e7c547;">(</span>setq count <span style="color: #e78c45;">(</span>1+ count<span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span>
      count<span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defun</span> <span style="color: #7aa6da;">wicked/org-update-checkbox-count</span> <span style="color: #7aa6da;">(</span>&amp;optional all<span style="color: #7aa6da;">)</span>
  <span style="color: #b9ca4a;">"Update the checkbox statistics in the current section.</span>
<span style="color: #b9ca4a;">This will find all statistic cookies like [57%] and [6/12] and update</span>
<span style="color: #b9ca4a;">them with the current numbers.  With optional prefix argument ALL,</span>
<span style="color: #b9ca4a;">do this for the whole buffer."</span>
  <span style="color: #7aa6da;">(</span>interactive <span style="color: #b9ca4a;">"P"</span><span style="color: #7aa6da;">)</span>
  <span style="color: #7aa6da;">(</span>save-excursion
    <span style="color: #70c0b1;">(</span>let* <span style="color: #b9ca4a;">(</span><span style="color: #e7c547;">(</span>buffer-invisibility-spec <span style="color: #e78c45;">(</span>org-inhibit-invisibility<span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span>
           <span style="color: #e7c547;">(</span>beg <span style="color: #e78c45;">(</span>condition-case <span style="color: #70c0b1;">nil</span>
                    <span style="color: #d54e53;">(</span>progn <span style="color: #969896;">(</span>outline-back-to-heading<span style="color: #969896;">)</span> <span style="color: #969896;">(</span>point<span style="color: #969896;">)</span><span style="color: #d54e53;">)</span>
                  <span style="color: #d54e53;">(</span>error <span style="color: #969896;">(</span>point-min<span style="color: #969896;">)</span><span style="color: #d54e53;">)</span><span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span>
           <span style="color: #e7c547;">(</span>end <span style="color: #e78c45;">(</span>move-marker
                 <span style="color: #d54e53;">(</span>make-marker<span style="color: #d54e53;">)</span>
                 <span style="color: #d54e53;">(</span>progn <span style="color: #969896;">(</span><span style="color: #c397d8;">or</span> <span style="color: #eaeaea;">(</span>outline-get-next-sibling<span style="color: #eaeaea;">)</span> <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(1)</span>
                            <span style="color: #eaeaea;">(</span>goto-char <span style="color: #c397d8;">(</span>point-max<span style="color: #c397d8;">)</span><span style="color: #eaeaea;">)</span><span style="color: #969896;">)</span>
                        <span style="color: #969896;">(</span>point<span style="color: #969896;">)</span><span style="color: #d54e53;">)</span><span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span>
           <span style="color: #e7c547;">(</span>re <span style="color: #b9ca4a;">"\\(\\[[0-9]*%\\]\\)\\|\\(\\[[0-9]*/[0-9]*\\]\\)"</span><span style="color: #e7c547;">)</span>
           <span style="color: #e7c547;">(</span>re-box
            <span style="color: #b9ca4a;">"^[ \t]*\\(*+\\|[-+*]\\|[0-9]+[.)]\\) +\\(\\[[- X]\\]\\)"</span><span style="color: #e7c547;">)</span>
           b1 e1 f1 c-on c-off lim <span style="color: #e7c547;">(</span>cstat 0<span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span>
      <span style="color: #b9ca4a;">(</span><span style="color: #c397d8;">when</span> all
        <span style="color: #e7c547;">(</span>goto-char <span style="color: #e78c45;">(</span>point-min<span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span>
        <span style="color: #e7c547;">(</span><span style="color: #c397d8;">or</span> <span style="color: #e78c45;">(</span>outline-get-next-sibling<span style="color: #e78c45;">)</span> <span style="color: #e78c45;">(</span>goto-char <span style="color: #d54e53;">(</span>point-max<span style="color: #d54e53;">)</span><span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span> <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(2)</span>
        <span style="color: #e7c547;">(</span>setq beg <span style="color: #e78c45;">(</span>point<span style="color: #e78c45;">)</span> end <span style="color: #e78c45;">(</span>point-max<span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span>
      <span style="color: #b9ca4a;">(</span>goto-char beg<span style="color: #b9ca4a;">)</span>
      <span style="color: #b9ca4a;">(</span><span style="color: #70c0b1;">while</span> <span style="color: #e7c547;">(</span>re-search-forward re end t<span style="color: #e7c547;">)</span>
        <span style="color: #e7c547;">(</span>setq cstat <span style="color: #e78c45;">(</span>1+ cstat<span style="color: #e78c45;">)</span>
              b1 <span style="color: #e78c45;">(</span>match-beginning 0<span style="color: #e78c45;">)</span>
              e1 <span style="color: #e78c45;">(</span>match-end 0<span style="color: #e78c45;">)</span>
              f1 <span style="color: #e78c45;">(</span>match-beginning 1<span style="color: #e78c45;">)</span>
              lim <span style="color: #e78c45;">(</span><span style="color: #c397d8;">cond</span>
                   <span style="color: #d54e53;">(</span><span style="color: #969896;">(</span>org-on-heading-p<span style="color: #969896;">)</span>
                    <span style="color: #969896;">(</span><span style="color: #c397d8;">or</span> <span style="color: #eaeaea;">(</span>outline-get-next-sibling<span style="color: #eaeaea;">)</span> <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(3)</span>
                        <span style="color: #eaeaea;">(</span>goto-char <span style="color: #c397d8;">(</span>point-max<span style="color: #c397d8;">)</span><span style="color: #eaeaea;">)</span><span style="color: #969896;">)</span>
                    <span style="color: #969896;">(</span>point<span style="color: #969896;">)</span><span style="color: #d54e53;">)</span>
                   <span style="color: #d54e53;">(</span><span style="color: #969896;">(</span>org-at-item-p<span style="color: #969896;">)</span> <span style="color: #969896;">(</span>org-end-of-item<span style="color: #969896;">)</span> <span style="color: #969896;">(</span>point<span style="color: #969896;">)</span><span style="color: #d54e53;">)</span>
                   <span style="color: #d54e53;">(</span>t <span style="color: #70c0b1;">nil</span><span style="color: #d54e53;">)</span><span style="color: #e78c45;">)</span>
              c-on 0 c-off 0<span style="color: #e7c547;">)</span>
        <span style="color: #e7c547;">(</span>goto-char e1<span style="color: #e7c547;">)</span>
        <span style="color: #e7c547;">(</span><span style="color: #c397d8;">when</span> lim
          <span style="color: #e78c45;">(</span><span style="color: #70c0b1;">while</span> <span style="color: #d54e53;">(</span>re-search-forward re-box lim t<span style="color: #d54e53;">)</span>
            <span style="color: #d54e53;">(</span><span style="color: #c397d8;">if</span> <span style="color: #969896;">(</span>member <span style="color: #eaeaea;">(</span>match-string 2<span style="color: #eaeaea;">)</span> '<span style="color: #eaeaea;">(</span><span style="color: #b9ca4a;">"[ ]"</span> <span style="color: #b9ca4a;">"[-]"</span><span style="color: #eaeaea;">)</span><span style="color: #969896;">)</span>
                <span style="color: #969896;">(</span>setq c-off <span style="color: #eaeaea;">(</span>1+ c-off<span style="color: #eaeaea;">)</span><span style="color: #969896;">)</span>
              <span style="color: #969896;">(</span>setq c-on <span style="color: #eaeaea;">(</span>1+ c-on<span style="color: #eaeaea;">)</span><span style="color: #969896;">)</span><span style="color: #d54e53;">)</span><span style="color: #e78c45;">)</span>
          <span style="color: #e78c45;">(</span>goto-char b1<span style="color: #e78c45;">)</span>
          <span style="color: #e78c45;">(</span>insert <span style="color: #d54e53;">(</span><span style="color: #c397d8;">if</span> f1
                      <span style="color: #969896;">(</span><span style="color: #70c0b1;">format</span> <span style="color: #b9ca4a;">"[%d%%]"</span> <span style="color: #eaeaea;">(</span>/ <span style="color: #c397d8;">(</span>* 100 c-on<span style="color: #c397d8;">)</span>
                                          <span style="color: #c397d8;">(</span><span style="color: #70c0b1;">max</span> 1 <span style="color: #7aa6da;">(</span>+ c-on c-off<span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span><span style="color: #eaeaea;">)</span><span style="color: #969896;">)</span>
                    <span style="color: #969896;">(</span><span style="color: #70c0b1;">format</span> <span style="color: #b9ca4a;">"[%d/%d]"</span> c-on <span style="color: #eaeaea;">(</span>+ c-on c-off<span style="color: #eaeaea;">)</span><span style="color: #969896;">)</span><span style="color: #d54e53;">)</span><span style="color: #e78c45;">)</span>
          <span style="color: #e78c45;">(</span><span style="color: #c397d8;">and</span> <span style="color: #d54e53;">(</span>looking-at <span style="color: #b9ca4a;">"\\[.*?\\]"</span><span style="color: #d54e53;">)</span>
               <span style="color: #d54e53;">(</span>replace-match <span style="color: #b9ca4a;">""</span><span style="color: #d54e53;">)</span><span style="color: #e78c45;">)</span><span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span>
      <span style="color: #b9ca4a;">(</span><span style="color: #c397d8;">when</span> <span style="color: #e7c547;">(</span>interactive-p<span style="color: #e7c547;">)</span>
        <span style="color: #e7c547;">(</span>message <span style="color: #b9ca4a;">"Checkbox statistics updated %s (%d places)"</span>
                 <span style="color: #e78c45;">(</span><span style="color: #c397d8;">if</span> all <span style="color: #b9ca4a;">"in entire file"</span> <span style="color: #b9ca4a;">"in current outline entry"</span><span style="color: #e78c45;">)</span>
                 cstat<span style="color: #e7c547;">)</span><span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
<span style="color: #c397d8;">(</span><span style="color: #c397d8;">defadvice</span> <span style="color: #7aa6da;">org-update-checkbox-count</span> <span style="color: #7aa6da;">(</span>around wicked activate<span style="color: #7aa6da;">)</span>
  <span style="color: #b9ca4a;">"Fix the built-in checkbox count to understand headlines."</span>
  <span style="color: #7aa6da;">(</span>setq ad-return-value
        <span style="color: #70c0b1;">(</span><span style="color: #e7c547;">wicked</span>/org-update-checkbox-count <span style="color: #b9ca4a;">(</span>ad-get-arg 1<span style="color: #b9ca4a;">)</span><span style="color: #70c0b1;">)</span><span style="color: #7aa6da;">)</span><span style="color: #c397d8;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Fecha: <span class="timestamp-wrapper"><span class="timestamp">[2015-03-27 vie 14:30]</span></span></p>
<p class="author">Autor: Miguel Angel Piña Avelino</p>
<p class="email">Email: <a href="mailto:miguel_pinia@ciencias.unam.mx">miguel_pinia@ciencias.unam.mx</a></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
